Revit 2024 API
StairsPathDirection Enumeration
 The direction style of stairs path.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public enum StairsPathDirection
Visual Basic
Public Enumeration StairsPathDirection
Visual C++
public enum class StairsPathDirection
Members
Member name | Description
AlwaysUp |  The direction of the stair path will always be UP direction.
AutomaticUpDown |  The direction of the stair path will be determined automatically.
See Also
Autodesk.Revit.DB.Architecture Namespace